## Plan for org_account/main
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `module.guardduty_forwarder.aws_ssm_parameter.sentinel_forwarder_auth`   |
|        | `module.securityhub_forwarder.aws_ssm_parameter.sentinel_forwarder_auth` |
| update | `module.guardduty_forwarder.aws_iam_policy.sentinel_forwarder_lambda`    |
|        | `module.guardduty_forwarder.aws_lambda_function.sentinel_forwarder`      |
|        | `module.securityhub_forwarder.aws_iam_policy.sentinel_forwarder_lambda`  |
|        | `module.securityhub_forwarder.aws_lambda_function.sentinel_forwarder`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.guardduty_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-guard-duty-forwarder:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.guardduty_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be updated in-place
  ~ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
        id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-guard-duty-forwarder"
        name      = "SentinelForwarderLambda-sentinel-guard-duty-forwarder"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-guard-duty-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.guardduty_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-guard-duty-forwarder"
      ~ last_modified                  = "2022-10-07T16:01:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:9",
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:125",
        ]
      ~ source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "cds-aws-lz-production"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CUSTOMER_ID" = (sensitive value)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.guardduty_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel_forwarder_auth"
      + tags           = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tags_all       = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.securityhub_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-securityhub-forwarder:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.securityhub_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be updated in-place
  ~ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
        id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-sentinel-securityhub-forwarder"
        name      = "SentinelForwarderLambda-sentinel-securityhub-forwarder"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/sentinel-securityhub-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.securityhub_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-securityhub-forwarder"
      ~ last_modified                  = "2022-10-07T16:01:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:9",
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:125",
        ]
      ~ source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "cds-aws-lz-production"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CUSTOMER_ID" = (sensitive value)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.securityhub_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel_forwarder_auth"
      + tags           = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tags_all       = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cds_sentinel_securityhub_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ct_list_controls"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.azure_sentinel"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.cloudtrail_sqs_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_log_archive_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
